<template>
    <section class="object-description">
        <div class="object-description--top">
            <a class="object-description__link-back" href="/objects">
                <ArrowBack />

                Назад к проектам
            </a>

            <h3 class="object-description__heading">
                Благоустройство жилого дома
            </h3>

            <ul class="object-description-list">
                <li class="object-description-list__item location">
                    <Location />

                    <p v-text="stone.location"></p>
                </li>
                <li class="object-description-list__item year">
                    <span>Год выполнения</span>
                    <span v-text="stone.year"></span>
                </li>
                <li class="object-description-list__item sqrt">
                    <span>Площадь объекта</span>
                    <span v-html="stone.sqrt"></span>
                </li>
            </ul>
        </div>

        <ObjectCarousel :images="stone.images" />

        <AboutTeams :lists="stone.lists" :heading="stone.heading" :headingStyle="stone.headingStyle || ''" :arrayStyle="stone.arrayStyle || ''"/>
    </section>
</template>

<script>
    import Location from "../assets/svg/Location.vue";
    import ObjectCarousel from "../components/ObjectCarousel/ObjectCarousel.vue";
    import AboutTeams from "../components/AboutDescription/AboutTeams.vue";
    import ArrowBack from "../assets/svg/ArrowBack.vue";

    export default {
        components: {
            Location,
            ObjectCarousel,
            AboutTeams,
            ArrowBack,
        },
        data() {
            return {
                stone: {
                    location: 'Китайско-Белорусский индустриальный парк «Великий Камень»',
                    year: '09.04.2021 г.',
                    sqrt: '37 991 м<sup>2</sup>',
                    images: [
                        {
                            id: 'stone-1',
                            src: 'https://yaramark.by/img/stone-1.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-2',
                            src: 'https://yaramark.by/img/stone-2.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-3',
                            src: 'https://yaramark.by/img/stone-3.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-4',
                            src: 'https://yaramark.by/img/stone-4.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-5',
                            src: 'https://yaramark.by/img/stone-5.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-6',
                            src: 'https://yaramark.by/img/stone-6.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-7',
                            src: 'https://yaramark.by/img/stone-7.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-8',
                            src: 'https://yaramark.by/img/stone-8.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-9',
                            src: 'https://yaramark.by/img/stone-9.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-10',
                            src: 'https://yaramark.by/img/stone-10.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-11',
                            src: 'https://yaramark.by/img/stone-11.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-12',
                            src: 'https://yaramark.by/img/stone-12.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-13',
                            src: 'https://yaramark.by/img/stone-13.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                        {
                            id: 'stone-14',
                            src: 'https://yaramark.by/img/stone-14.jpg',
                            alt: `«Модернизация благоустройства жилого дома с инвентарным номером 614/С-47068 по адресу: Республика Беларусь, Минская область, Смолевичский район, Китайско-Белорусский индустриальный парк «Великий Камень», ул. Дружная, 1»`,
                        },
                    ],
                    heading: 'Полный комплекс работ по благоустройству:',
                    lists: [
                        'Устройство борта тротуарного и дорожного',
                        'Устройство плиточного основания',
                        'Устройство отмостки',
                        'Установка ограждения'
                    ],
                    headingStyle: {
                        marginBottom: '33px',
                    },
                    arrayStyle: {
                        marginBottom: '130px',
                    }
                }
            }
        },
    }
</script>